Adding docs build (#16)
Mermaid js

cleanup

links

Signed-off-by: Aidan Reilly <aireilly@redhat.com>
